[A_WaterScholar_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="万水学者"
mTooltip="水系法术的法力消耗降低 %special.norm%。"

[A_WaterWisdom_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="万水智慧"
mTooltip="%stat1 %stat1.icon 魔力用于水系法术。其他智慧技能每级为此加成增加 %stat1 %stat1.icon 魔力。"

[A_WaterShield_Buff H7BaseBuff]
mName="神水护盾"
mTooltip="对此生物造成的伤害降低 %res.norm。持续 %durnow 回合或直到该生物受到伤害。"

[A_Frostbite_Buff H7BaseBuff]
mName="霜寒刺骨"
mTooltip=""

[A_WaterShield_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="神水护盾"
mTooltip="所有友方生物在战斗开始时获得一个神水护盾，可将首次对该生物造成的伤害降低 %buff.buff.res.norm。持续 %buff.buff.durini 回合。"

[A_Chill_Ability H7HeroAbility]
mName="寒颤"
mTooltip="所有水系魔法伤害法术以及在冻土上移动会对其目标施加“麻木”减益，使其下一回合的主动性降低 20。"

[A_DeepFreeze_Ability H7HeroAbility]
mName="深度冻结"
mTooltip="霜冻箭矢目标的移动力减少 3，但在战斗回合结束前不能低于 1。"

[A_Frostbite_CreatureAbility H7CreatureAbility]
mName="霜寒刺骨"
[A_ImprovedTier1Spells_Ability H7HeroAbility]
mName="水系学识I"
mTooltip="如果生物造成或受到近战伤害，%spell1.name 不再被移除。\n%spell2.name 现在减少生物移动力，持续 %spell2.spell.buff1.buff.buff.buff.durini2 回合。"

[A_ImprovedTier2Spells_Ability H7HeroAbility]
mName="水系学识II"
mTooltip="所有被霜冻箭矢或凝冰之击伤害的生物获得“深度冻结”减益，使其移动力在 3 回合内减少 3。"

[A_ImprovedTier3Spells_Ability H7HeroAbility]
mName="水系学识III"
mTooltip="流水护膜同时增加 5 点移动力。严冬冰环同时施加“深度冻结”，使其移动力在 3 回合内减少 3。"

[A_PersistentFog_Ability H7HeroAbility]
mName="浓重雾气"
mTooltip="迷雾重重不会因造成或受到近战伤害而被移除。"

[A_ProtectiveMembrane_Ability H7HeroAbility]
mName="保护膜"
mTooltip="在战斗开始时，为每个友方生物施加一个增益效果，在 3 回合内对首次受到的伤害提供 25% 的伤害防护。"

[A_ProtectiveMembrane_Buff H7BaseBuff]
mName="保护膜"
mTooltip="对此生物造成的首次伤害降低 25%。"

[A_WaterFlowsFreely_Ability H7HeroAbility]
mName="水之流动"
mTooltip="流水护膜同时增加目标友方生物的移动力 5 点。"

[A_WreckingTsunami_Ability H7HeroAbility]
mName="巨浪海啸"
mTooltip="海啸额外对目标区域内所有可破坏的障碍物造成水系魔法伤害。"

7.5_mod : 

[A_MasterOfWater_I_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="水系学识I"
mTooltip="如果生物受到伤害，%spell1.name 不再被移除。\n%spell2.name 现在减少生物移动力，持续 %spell2.spell.buff1.buff.durini2 回合。"

7.5_v2

[A_MasterOfWater_II_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="水系学识II"
mTooltip="被 %spell1.name 或 %spell2.name 伤害的生物额外获得 %spell1.spell.buff.buff.stat %spell1.spell.buff.buff.stat.icon 移动力，持续 %spell1.spell.buff.buff.durini 回合。\n%spell3.name 曾触及一个 4x4 区域。"

v1.37

[A_Frostbite_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="霜寒刺骨"
mTooltip="在敌方生物回合开始时，它因其身上的每个负面水系效果而受到 %buff1.buff.d1.min 到 %buff1.buff.d1.max %ICON_WATER 水系伤害。\n如果英雄拥有所需的知识，则有几率学会一个新的 4 级水系法术。"

v1.38.2

[A_MasterOfWater_III_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="水系学识III"
mTooltip="%spell1.name 同时增加 %spell1.spell.buff2.buff.stat.norm 的 %icon_movement 移动力。\n被 %spell2.name 伤害的生物额外获得 %spell2.spell.buff1.buff.stat %spell2.spell.buff1.buff.stat.icon 移动力，持续 %spell2.spell.buff1.buff.durini 回合。\n%spell3.name 现在防止在一个 4x4 区域内的治疗。\n%spell5.name 现在在一个 3x3 区域内治疗。"

v1.41

[A_WaterMagic_Skill H7Skill]
mName="水系魔法"
mTooltip="允许你在魔法行会中学习水系魔法学派的法术。改进并增强其效果。"
mDescriptions[0]="使水系法术更有效，并增加英雄的 %ICON_ARCANE_KNOWLEDGE 源力知识。"
mDescriptions[1]=""
mDescriptions[2]="使水系法术更有效，并增加英雄的 %ICON_ARCANE_KNOWLEDGE 源力知识 1 点。\n英雄有几率学会一个新的 1 级水系法术。"
mDescriptions[3]="使水系法术更有效，并额外增加英雄的 %ICON_ARCANE_KNOWLEDGE 源力知识 2 点。\n如果英雄拥有所需的知识，则有几率学会一个新的 2 级水系法术。"
mDescriptions[4]="使水系法术更有效，并额外增加英雄的 %ICON_ARCANE_KNOWLEDGE 源力知识 3 点。\n如果英雄拥有所需的知识，则有几率学会一个新的 3 级水系法术。\n\n当与<font color=\"#00588BFF\">防御</font>技能达到大师级结合时，解锁<font color=\"#00FFCB44\">协同能力</font>：液态光环。"